nychiking_trails_api/app/controllers/boroughs_controller.rb

    def index
         @boroughs = Borough.all
---
SELECT "boroughs".* FROM "boroughs"