nychiking_trails_api/app/controllers/trails_controller.rb

        def index
          @trails = Trail.all
---
SELECT "trails".* FROM "trails"

          def set_trail
            @trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]