nyc_hiking_trails_api/app/controllers/boroughs_controller.rb

SELECT "boroughs".* FROM "boroughs"
---
    def index
         @boroughs = Borough.all