nyc_hiking_trails_api/app/controllers/comments_controller.rb

    def index
        @comments =  if params[:trail_id]
            Comment.where(trail_id: params[:trail_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."trail_id" = ?  [["trail_id", 13]]