nyc_hiking_trails_api/app/controllers/trails_controller.rb

        def index
          # byebug
          @borough = Borough.find_by_id(params[:borough_id])
---
SELECT "boroughs".* FROM "boroughs" WHERE "boroughs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

        def update
          @trail = Trail.find_by_id(params[:id])
          @trail.update(likes: @trail.likes + 1)
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "trails" SET "likes" = ?, "updated_at" = ? WHERE "trails"."id" = ?  [["likes", 10], ["updated_at", "2020-12-27 03:06:47.324418"], ["id", 1]]

          def set_trail
            @trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]